import Foundation

struct Quotes {
    // テキストの配列
    private let texts = ["１円玉１枚を作るための材料費は３円かかる", "ケンタッキーフライドチキンの味付けのレシピを知っている人物は世界中にたった２人しかいない。", "人は一生のうち、寝ている間に１０匹以上のクモを食べている。", "海は全体の5％しか解明されておらず、95％はいまだ未知の世界。", "「女子高生」は伊藤ハムの商標登録", "日本の歯医者の数はコンビニの数より多い。", "夏目漱石の脳は、エタノールに漬けられた状態で東京大学医学部に保管されている。", "ある少年が、サッカーの試合中にボールを抱えたまま相手ゴールに走り出したことがきっかけで生まれたのがラグビー。", "スマートフォンの電話の声は本人の声ではなく、膨大な音声データの中から本人に似ているものが選ばれ、それが相手の耳に届けられている。", "ゆず胡椒にコショウは入っていない。", "南極ではどんなに寒くても人が風邪をひくことはない。（あまりの寒さでウィルスが存在していないため。）", "病院で使われている麻酔の中には、なぜ効くのか解明されていないものがある。", "スーパーのレジに並ぶ際、出口に一番近いレジに並ぶと列の進みが早い。（出口側の一番端にベテランを配置することが多いため。）", "ほとんどの銀行に観葉植物が置いてある理由は、万が一銀行強盗に襲われた時に犯人の身長の目安が一目で分かるようにするため。高さは170cmと決まっている。", "ロケットで初めて宇宙に行った人間以外の生き物はハエ。", "うんちはトイレットペーパー30枚重ねでも菌がすり抜け指につく。", "トウモロコシの粒の数は必ず偶数。", "下剤と下痢止めを一緒に飲むと下痢になる。", "布団を干した時のいいニオイはダニの死骸やフンの臭い。", "ビール１杯で１００万個の脳細胞が死ぬ。", "恐竜の色は誰にも分からず適当に決められた。", "ローラースケートの開発者は初めて滑った時、止まり方を考えておらず重症を負った。", "プーマとアディダスの創設者は兄弟、そして仲が悪い。", "自動販売機のボタンを２つ同時に押すと、必ず左側の商品が出てくる。", "切手を舐めた時の摂取カロリーは２kcal。", "コーヒーをよく飲む人は、飲まない人に比べてがんになるリスクが低い。", "鼻呼吸は片方の穴しか使っていない。", "股間のチャックが原因で病院に運ばれる男性が毎年１７００人近くいる。", "ケチャップは１８３０年代のアメリカでは薬として特許が取られていた。", "サイコロは６面それぞれの穴の数によって重量に誤差が出る為、出る目の確率は均等ではない。※一番出やすい目の数は５だと言われている。", "マリオはあー見えてまだ２６歳。ちなみに身長は１５５ｃｍ。", "シンデレラは人を殺したことがある。", "指名手配犯が自首しても罪は軽くならない。", "「焦げを食べるとガンになる」に医学的根拠はない。", "歯を磨くとき、歯ブラシは濡らさない方がより綺麗に磨ける。", "ロダンの「考える人」は、考えているのではなく地獄で苦しむ人をただ見ているだけ。", "「嬉しいとき」「悲しいとき」「ウソ泣き」など、感情によって涙の味は変わる。", "サンリオの人気キャラクター「キキララ」の身長は1700kmを超える。",   "ハチは仲間にダンスで情報を伝える。","タコの心臓は3つあり、血は青い。", "宇宙ではペンが書けないのでNASAは無重力ペンを開発した。", "バナナは木ではなく草の仲間。", "カンガルーは後ろ向きに歩けない。", "蜂蜜は腐らないので何千年も保存できる。", "ペンギンは求愛の際に小石をプレゼントする。", "シロクマの皮膚は黒く、毛は透明。", "地球上で最も硬い物質は人工的に作られたカーボンナノチューブ。", "ウォンバットのフンは四角形。", "リンゴのDNAは人間と約50%同じ。", "ウミガメの性別は卵が孵る温度で決まる。", "アインシュタインの脳は普通より15%大きかった。", "イカは心臓が3つあり、血が青い。", "カフェインはクモの巣の形を狂わせる。", "ピーナッツはナッツではなく豆の仲間。", "チョコレートは犬にとって毒になる。", "アボカドは果物の中で最もカロリーが高い。", "南極には唯一、哺乳類が生息していない。", "オウムは人間の声を真似するが、意味を理解していない。", "シマウマの縞模様は虫よけ効果がある。", "電気ウナギは400ボルト以上の電流を発生させる。", "ダチョウの目は脳よりも大きい。", "サメは恐竜よりも前から地球に存在していた。", "ウサギは目を開けたまま寝ることができる。", "ミツバチは世界で最も重要な生物に選ばれたことがある。", "ロブスターは寿命を迎えないとされている。", "アルパカは怒るとツバを吐く。", "ゾウは飛び跳ねることができない。", "クラゲは脳がなくても生きている。", "花火が打ち上げられた時に出る「ヒュー」という音は、玉が風を切っている時に出る音ではなく意図的に出している音。", "保冷剤と消臭剤の中身は同じ。", "人は一生のうちに平均15回殺人犯とすれ違っている。", "行く方向が分からなくなったとき、人は無意識に左に行く傾向がある。", "働き蟻の８割はサボっている。", "味噌汁は4リットル飲むと死ぬ。", "インド料理にカレーという名前の料理は存在しない。", "日本人の年間死亡原因の第一位はガンではなく中絶。", "南極では、どんなに寒くても人は風邪をひかない。", "人間は生まれた時に350の骨がある。が、大人になると206まで減少する。これは成長と共に、骨同士が融合していくため", "世界一長い曲は演奏が終わるまでに639年かかる", "NHKは『ゴールデンウィーク』という言葉を使わない", "両国国技館の地下には日本最大級の焼き鳥工場がある"]
    

    private var shuffledTexts: [String]
    private var index: Int
    init() {
        self.shuffledTexts = texts.shuffled()
        self.index = 0
    }
    
    mutating func getRandomText() -> String {
        if index >= shuffledTexts.count {
            shuffledTexts = texts.shuffled()
            index = 0
        }
        let text = shuffledTexts[index]
        index += 1
        return text
        }
    }
    
// Quotesのインスタンスを作成してランダムなテキストを取得
var quotes = Quotes()
let randomText = quotes.getRandomText()

//print(randomText)



